xml-resources/web-service-references/SessionControlEndpointSlsb/wsdl/SessionControlEndpointSlsb.wsdl

<?xml version="1.0" encoding="UTF-8"?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.3.2-hudson-754-SNAPSHOT. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.3.2-hudson-754-SNAPSHOT. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://provisioning.iap.iptv.ericsson.com/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://provisioning.iap.iptv.ericsson.com/" name="SessionControlEndpointSlsbService">
<import namespace="http://schemas.ericsson.com/cai3g1.2/" location="SessionControlEndpointSlsb.wsdl_1.wsdl"></import>
<binding xmlns:ns1="http://schemas.ericsson.com/cai3g1.2/" name="SessionControlEndpointSlsbPortBinding" type="ns1:SessionControl">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"></soap:binding>
<operation name="Login">
<soap:operation soapAction="CAI3G#Login"></soap:operation>
<input>
<soap:body use="literal"></soap:body>
</input>
<output>
<soap:body use="literal"></soap:body>
</output>
<fault name="Cai3GFault_Exception">
<soap:fault name="Cai3GFault_Exception" use="literal"></soap:fault>
</fault>
</operation>
<operation name="Logout">
<soap:operation soapAction="CAI3G#Logout"></soap:operation>
<input>
<soap:body use="literal"></soap:body>
</input>
<output>
<soap:body use="literal"></soap:body>
</output>
<fault name="Cai3GFault_Exception">
<soap:fault name="Cai3GFault_Exception" use="literal"></soap:fault>
</fault>
</operation>
</binding>
<service name="SessionControlEndpointSlsbService">
<port name="SessionControlEndpointSlsbPort" binding="tns:SessionControlEndpointSlsbPortBinding">
<soap:address location="http://127.0.0.1:38080/provisioning/SessionControlEndpointSlsb"></soap:address>
</port>
</service>
</definitions>