GalaxionAutomation/requests/soap/hlr/login

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <cai3:Login xmlns:cai3="http://schemas.ericsson.com/cai3g1.2/">
      <cai3:userId>cai3g</cai3:userId>
      <cai3:pwd>Cai3g123!</cai3:pwd>
    </cai3:Login>
  </soapenv:Body>
</soapenv:Envelope>